cfg_src/gitConverter/Reports/ctmСкоростьЭтаповКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ctmСкоростьЭтаповКонвертации</Name>
			<Comment>Отчёт по времени этапов конвертации (по данным регистра СостоянияВерсии)</Comment>
		</Properties>
	</Report>
</MetaDataObject>

cfg_src/gitConverter/InformationRegisters/СостоянияВерсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВерсии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВерсияХранилища</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииХранилища</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg_src/gitConverter/Enums/СостоянияВерсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияВерсии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолучениеВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВерсияПолучена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВерсияВыгружена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаМетаданных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МетаданныеЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоКоммита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВерсияПомещена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg_src/gitConverter/Catalogs/ВерсииХранилища.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВерсииХранилища</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ХранилищаКонфигураций</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКаталогФайловКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКаталогИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВерсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
						<v8:Type>cfg:CatalogRef.ОчередиВыполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.КопииХранилищКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМетаданных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ноВременныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ноКоличествоМетаданныхКоммита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg_src/gitConverter/Reports/ctmСкоростьЭтаповКонвертации/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Отчёт «Скорость этапов конвертации».
//
// Источник данных — история регистра сведений «СостоянияВерсии»: длительность этапа равна времени
// между сменой состояния версии и следующей сменой состояния той же версии.
// Версии усредняются, результат — агрегаты (среднее, медиана, минимум, максимум, сумма)
// по каждому этапу. Незавершённые циклы и выбросы (короче порога) отсекаются.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует результат отчёта: заполняет объектный набор данных «Этапы» и компонует результат.
//
// Параметры:
//  ДокументРезультат - ТабличныйДокумент - документ, в который выводится результат
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных, Неопределено - данные расшифровки
//  СтандартнаяОбработка - Булево - признак стандартной обработки (отключается)
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Хранилище = ЗначениеПараметра("Хранилище");
	НачалоПериода = ЗначениеПараметра("НачалоПериода");
	КонецПериода = ЗначениеПараметра("КонецПериода");
	ИсключатьАномалии = ЗначениеПараметра("ИсключатьАномалии");
	МинимальнаяДлительностьСек = ЗначениеПараметра("МинимальнаяДлительностьСек");
	ПоказыватьОжидания = ЗначениеПараметра("ПоказыватьОжидания");

	// Значения по умолчанию (на случай, если параметр не попал в настройки)
	Если ИсключатьАномалии = Неопределено Тогда
		ИсключатьАномалии = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(МинимальнаяДлительностьСек) Тогда
		МинимальнаяДлительностьСек = 60;
	КонецЕсли;
	Если ПоказыватьОжидания = Неопределено Тогда
		ПоказыватьОжидания = Истина;
	КонецЕсли;

	ТаблицаЭтапов = РассчитатьЭтапы(Хранилище, НачалоПериода, КонецПериода,
		ИсключатьАномалии, МинимальнаяДлительностьСек, ПоказыватьОжидания);

	ВнешниеНаборыДанных = Новый Структура("Этапы", ТаблицаЭтапов);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),
		ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанных"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает значение параметра отчёта: из пользовательских настроек, иначе — из схемы компоновки.
//
// Параметры:
//  Имя - Строка - имя параметра
//
// Возвращаемое значение:
//  Произвольный - значение параметра либо Неопределено
Функция ЗначениеПараметра(Имя)

	Для Каждого ЭлементНастройки Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл

		// У объекта «Параметр компоновки данных» нет отдельного свойства с именем:
		// он конструируется «на основе имени параметра», и представление равно имени.
		Если Строка(ЭлементНастройки.Параметр) <> Имя Тогда
			Продолжить;
		КонецЕсли;

		Если ЭлементНастройки.Использование Тогда
			Возврат ЭлементНастройки.Значение;
		КонецЕсли;

	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Рассчитывает агрегаты по этапам конвертации на основании истории состояний версий.
//
// Параметры:
//  Хранилище - СправочникСсылка.ХранилищаКонфигураций - отбор по хранилищу (пустая - все)
//  НачалоПериода, КонецПериода - Дата - отбор по периоду (пустые - без ограничения)
//  ИсключатьАномалии - Булево - отсекать замеры короче порога
//  МинимальнаяДлительностьСек - Число - порог отсечения замеров, секунд
//  ПоказыватьОжидания - Булево - выводить этапы вида «Ожидание»
//
// Возвращаемое значение:
//  ТаблицаЗначений - агрегаты по этапам (по одной строке на этап)
Функция РассчитатьЭтапы(Хранилище, НачалоПериода, КонецПериода,
	ИсключатьАномалии, МинимальнаяДлительностьСек, ПоказыватьОжидания)

	Таблица = НоваяТаблицаЭтапов();

	Если НЕ ЗначениеЗаполнено(Хранилище) Тогда
		Хранилище = Справочники.ХранилищаКонфигураций.ПустаяСсылка();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		НачалоПериода = Дата(1, 1, 1);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		КонецПериода = Дата(1, 1, 1);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВХ.Ссылка КАК Версия,
	|	ВХ.Код КАК Код,
	|	СВ.Период КАК Период,
	|	СВ.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостоянияВерсии КАК СВ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВерсииХранилища КАК ВХ
	|		ПО СВ.ВерсияХранилища = ВХ.Ссылка
	|ГДЕ
	|	НЕ ВХ.ПометкаУдаления
	|	И (&Хранилище = ЗНАЧЕНИЕ(Справочник.ХранилищаКонфигураций.ПустаяСсылка) ИЛИ ВХ.Владелец = &Хранилище)
	|	И (&ПериодС = ДАТАВРЕМЯ(1, 1, 1) ИЛИ СВ.Период >= &ПериодС)
	|	И (&ПериодПо = ДАТАВРЕМЯ(1, 1, 1) ИЛИ СВ.Период <= &ПериодПо)
	|УПОРЯДОЧИТЬ ПО
	|	ВХ.Ссылка,
	|	СВ.Период";
	Запрос.УстановитьПараметр("Хранилище", Хранилище);
	Запрос.УстановитьПараметр("ПериодС", НачалоПериода);
	Запрос.УстановитьПараметр("ПериодПо", КонецПериода);

	Выборка = Запрос.Выполнить().Выбрать();

	// Замеры: ключ — номер этапа, значение — структура с описанием этапа и массивом длительностей
	Замеры = Новый Соответствие;

	ТекущаяВерсия = Неопределено;
	ПредыдущаяЗапись = Неопределено;
	ЗамерыЦикла = Новый Массив;

	Пока Выборка.Следующий() Цикл

		Если Выборка.Версия <> ТекущаяВерсия Тогда
			ТекущаяВерсия = Выборка.Версия;
			ПредыдущаяЗапись = Неопределено;
			ЗамерыЦикла = Новый Массив;
		КонецЕсли;

		// Пустое состояние — сброс/пауза: цикл прерывается, замеры не принимаются
		Если НЕ ЗначениеЗаполнено(Выборка.Состояние) Тогда
			ПредыдущаяЗапись = Неопределено;
			ЗамерыЦикла = Новый Массив;
			Продолжить;
		КонецЕсли;

		// Начало нового цикла получения версии
		Если Выборка.Состояние = Перечисления.СостоянияВерсии.ПолучениеВерсии Тогда
			ПредыдущаяЗапись = ТекущаяЗапись(Выборка);
			ЗамерыЦикла = Новый Массив;
			Продолжить;
		КонецЕсли;

		Если ПредыдущаяЗапись <> Неопределено Тогда

			Описание = ОписаниеЭтапа(ПредыдущаяЗапись.Состояние, Выборка.Состояние);
			Если Описание <> Неопределено Тогда
				Длительность = Выборка.Период - ПредыдущаяЗапись.Период;
				ЗамерыЦикла.Добавить(Новый Структура("Описание, Длительность", Описание, Длительность));
			КонецЕсли;

		КонецЕсли;

		// Цикл успешно завершён — принимаем замеры
		Если Выборка.Состояние = Перечисления.СостоянияВерсии.ВерсияПомещена Тогда
			Для Каждого Замер Из ЗамерыЦикла Цикл
				ДобавитьЗамер(Замеры, Замер.Описание, Замер.Длительность,
					ИсключатьАномалии, МинимальнаяДлительностьСек, ПоказыватьОжидания);
			КонецЦикла;
			ЗамерыЦикла = Новый Массив;
		КонецЕсли;

		// Важно: сохраняем снимок значений, а не объект выборки (курсор смещается при Следующий())
		ПредыдущаяЗапись = ТекущаяЗапись(Выборка);

	КонецЦикла;

	// Агрегация по этапам
	Для Каждого КлючИЗначение Из Замеры Цикл

		Описание = КлючИЗначение.Значение.Описание;
		МассивДлительностей = КлючИЗначение.Значение.Длительности;

		Сумма = 0;
		Минимум = Неопределено;
		Максимум = Неопределено;
		Для Каждого Длительность Из МассивДлительностей Цикл
			Сумма = Сумма + Длительность;
			Если Минимум = Неопределено ИЛИ Длительность < Минимум Тогда
				Минимум = Длительность;
			КонецЕсли;
			Если Максимум = Неопределено ИЛИ Длительность > Максимум Тогда
				Максимум = Длительность;
			КонецЕсли;
		КонецЦикла;

		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.ПорядокЭтапа = Описание.Порядок;
		СтрокаТаблицы.Этап = Описание.Этап;
		СтрокаТаблицы.ВидЭтапа = Описание.Вид;
		СтрокаТаблицы.КоличествоЗамеров = МассивДлительностей.Количество();
		СтрокаТаблицы.СреднееМин = Сумма / МассивДлительностей.Количество() / 60;
		СтрокаТаблицы.МедианаМин = Медиана(МассивДлительностей) / 60;
		СтрокаТаблицы.МинимумМин = Минимум / 60;
		СтрокаТаблицы.МаксимумМин = Максимум / 60;
		СтрокаТаблицы.СуммаМин = Сумма / 60;

	КонецЦикла;

	Таблица.Сортировать("ПорядокЭтапа");

	Возврат Таблица;

КонецФункции

// Создаёт таблицу агрегатов по этапам.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки: ПорядокЭтапа, Этап, ВидЭтапа, КоличествоЗамеров,
//      СреднееМин, МедианаМин, МинимумМин, МаксимумМин, СуммаМин (значения — в минутах)
Функция НоваяТаблицаЭтапов()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ПорядокЭтапа", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Этап", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ВидЭтапа", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("КоличествоЗамеров", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("СреднееМин", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("МедианаМин", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("МинимумМин", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("МаксимумМин", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("СуммаМин", Новый ОписаниеТипов("Число"));

	Возврат Таблица;

КонецФункции

// Возвращает снимок значений текущей строки выборки истории состояний.
//
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса - выборка регистра СостоянияВерсии
//
// Возвращаемое значение:
//  Структура - Состояние, Период
Функция ТекущаяЗапись(Выборка)

	Возврат Новый Структура("Состояние, Период", Выборка.Состояние, Выборка.Период);

КонецФункции

// Возвращает описание этапа для пары «текущее состояние — следующее состояние».
// Этап определяется состоянием, в котором находилась версия на протяжении интервала.
//
// Параметры:
//  ТекущееСостояние, СледующееСостояние - ПеречислениеСсылка.СостоянияВерсии
//
// Возвращаемое значение:
//  Структура, Неопределено - Порядок, Этап, Вид; Неопределено — интервал не учитывается
Функция ОписаниеЭтапа(ТекущееСостояние, СледующееСостояние)

	С = ТекущееСостояние;

	Если С = Перечисления.СостоянияВерсии.ПолучениеВерсии Тогда
		Возврат Новый Структура("Порядок, Этап, Вид", 1, "1. Получение версии из хранилища", "Работа");
	КонецЕсли;
	Если С = Перечисления.СостоянияВерсии.ВерсияПолучена Тогда
		Возврат Новый Структура("Порядок, Этап, Вид", 2, "2. Ожидание выгрузки (очередь)", "Ожидание");
	КонецЕсли;
	Если С = Перечисления.СостоянияВерсии.ВыгрузкаВерсии Тогда
		Возврат Новый Структура("Порядок, Этап, Вид", 3, "3. Выгрузка конфигурации в файлы", "Работа");
	КонецЕсли;
	Если С = Перечисления.СостоянияВерсии.ВерсияВыгружена Тогда
		// Промежуточное состояние «ЗагрузкаМетаданных» фиксируется не всегда:
		// тогда интервал включает и ожидание, и загрузку метаданных.
		Если СледующееСостояние = Перечисления.СостоянияВерсии.МетаданныеЗагружены Тогда
			Возврат Новый Структура("Порядок, Этап, Вид", 4.5, "4. Ожидание и загрузка метаданных", "Смешанный");
		КонецЕсли;
		Возврат Новый Структура("Порядок, Этап, Вид", 4, "4. Ожидание загрузки метаданных", "Ожидание");
	КонецЕсли;
	Если С = Перечисления.СостоянияВерсии.ЗагрузкаМетаданных Тогда
		Возврат Новый Структура("Порядок, Этап, Вид", 5, "5. Загрузка метаданных", "Работа");
	КонецЕсли;
	Если С = Перечисления.СостоянияВерсии.МетаданныеЗагружены Тогда
		Возврат Новый Структура("Порядок, Этап, Вид", 6, "6. Ожидание коммита", "Ожидание");
	КонецЕсли;
	Если С = Перечисления.СостоянияВерсии.НачалоКоммита Тогда
		Возврат Новый Структура("Порядок, Этап, Вид", 7, "7. Коммит в Git", "Работа");
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Добавляет замер в накопитель с учётом отборов по виду этапа и минимальной длительности.
//
// Параметры:
//  Замеры - Соответствие - накопитель замеров (ключ — номер этапа)
//  Описание - Структура - Порядок, Этап, Вид
//  Длительность - Число - длительность этапа, секунд
//  ИсключатьАномалии - Булево - отсекать замеры короче порога
//  МинимальнаяДлительностьСек - Число - порог отсечения, секунд
//  ПоказыватьОжидания - Булево - выводить этапы вида «Ожидание»
Процедура ДобавитьЗамер(Замеры, Описание, Длительность, ИсключатьАномалии,
	МинимальнаяДлительностьСек, ПоказыватьОжидания)

	Если НЕ ПоказыватьОжидания И Описание.Вид = "Ожидание" Тогда
		Возврат;
	КонецЕсли;

	Если ИсключатьАномалии И ЗначениеЗаполнено(МинимальнаяДлительностьСек)
		И Длительность < МинимальнаяДлительностьСек Тогда
		Возврат;
	КонецЕсли;

	Запись = Замеры.Получить(Описание.Порядок);
	Если Запись = Неопределено Тогда
		Запись = Новый Структура("Описание, Длительности", Описание, Новый Массив);
		Замеры.Вставить(Описание.Порядок, Запись);
	КонецЕсли;

	Запись.Длительности.Добавить(Длительность);

КонецПроцедуры

// Возвращает медиану массива чисел.
//
// Параметры:
//  Значения - Массив - массив чисел
//
// Возвращаемое значение:
//  Число - медиана (0 для пустого массива)
Функция Медиана(Значения)

	Если Значения.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Копия = Новый Массив;
	Для Каждого Значение Из Значения Цикл
		Копия.Добавить(Значение);
	КонецЦикла;

	// Сортировка вставками (метод «Сортировать» у Массива в этой версии платформы недоступен)
	Для Внешний = 1 По Копия.ВГраница() Цикл
		ЗначениеСорт = Копия[Внешний];
		Внутренний = Внешний - 1;
		Пока Внутренний >= 0 И Копия[Внутренний] > ЗначениеСорт Цикл
			Копия[Внутренний + 1] = Копия[Внутренний];
			Внутренний = Внутренний - 1;
		КонецЦикла;
		Копия[Внутренний + 1] = ЗначениеСорт;
	КонецЦикла;

	Середина = Цел(Копия.Количество() / 2);
	Если Копия.Количество() % 2 = 1 Тогда
		Возврат Копия[Середина];
	КонецЕсли;

	Возврат (Копия[Середина - 1] + Копия[Середина]) / 2;

КонецФункции

#КонецОбласти
